import os

class Config:
    # log
    log_path = 'logs.log'
    log_level = 'info'

    # file_path
    data_root_path = os.path.join(os.path.dirname(__file__), 'data')
    data_dirs = ['57707毕节', '57713-遵义红花岗', '57722 湄潭', '57737 施秉', '57739 玉屏', '57807-六枝',
                 '57816-小河', '57821-福泉', '57835-剑河', '57909-册亨', '57916 罗甸', '57922独山']
    areas = ['毕节', '遵义红花岗', '湄潭', '施秉', '玉屏', '六枝', '小河', '福泉', '剑河', '册亨', '罗甸', '独山']

    # data
    weather_columns = ['区站号', '年份', '月份', '日期', '日平均气温(℃)', '日气温日较差(℃)', '日最高气温(℃)',
                       '日最低气温(℃)', '日平均相对湿度(%)', '日最小相对湿度(%)', '日平均气压(hpa)', '日最高气压(hpa)',
                       '日最低气压(hpa)', '日平均海平面气压(hpa)', '日平均水汽压(hpa)', '日最高水汽压(hpa)',
                       '日最低水汽压(hpa)', '日降水量(mm)', '日日照时数(小时)', '日平均风速(m/s)', '日最大风速(m/s)',
                       '日极大风速(m/s)', '日平均总云量(成)', '日平均低云量(成)', '日最小能见度(m)', '日小型蒸发量(mm)',
                       '日大型蒸发量(mm)', '日积雪深度(cm)', '日雪压(g/cm2)', '日平均地表温度(℃)', '日最高地表温度(℃)',
                       '日最低地表温度(℃)', '日平均5cm地温(℃)', '日平均10cm地温(℃)', '日平均15cm地温(℃)',
                       '日平均20cm地温(℃)', '日平均40cm地温(℃)', '日平均0.8m地温(℃)', '日平均1.6m地温(℃)',
                       '日平均3.2m地温(℃)', '日第1层冻土上界(cm)', '日第1层冻土下界(cm)', '日平均草面温度(℃)',
                       '日最高草面温度(℃)', '日最低草面温度(℃)', '日均露点温度(℃)', '日太阳总辐射(MJ/m2)',
                       '日净全辐射(MJ/m2)']
    weather_columns_int = ['区站号', '年份', '月份', '日期']
    weather_columns_float = ['日平均气温(℃)', '日气温日较差(℃)', '日最高气温(℃)',
                             '日最低气温(℃)', '日平均相对湿度(%)', '日最小相对湿度(%)', '日平均气压(hpa)', '日最高气压(hpa)',
                             '日最低气压(hpa)', '日平均海平面气压(hpa)', '日平均水汽压(hpa)', '日最高水汽压(hpa)',
                             '日最低水汽压(hpa)', '日降水量(mm)', '日日照时数(小时)', '日平均风速(m/s)', '日最大风速(m/s)',
                             '日极大风速(m/s)', '日平均总云量(成)', '日平均低云量(成)', '日最小能见度(m)', '日小型蒸发量(mm)',
                             '日大型蒸发量(mm)', '日积雪深度(cm)', '日雪压(g/cm2)', '日平均地表温度(℃)', '日最高地表温度(℃)',
                             '日最低地表温度(℃)', '日平均5cm地温(℃)', '日平均10cm地温(℃)', '日平均15cm地温(℃)',
                             '日平均20cm地温(℃)', '日平均40cm地温(℃)', '日平均0.8m地温(℃)', '日平均1.6m地温(℃)',
                             '日平均3.2m地温(℃)', '日第1层冻土上界(cm)', '日第1层冻土下界(cm)', '日平均草面温度(℃)',
                             '日最高草面温度(℃)', '日最低草面温度(℃)', '日均露点温度(℃)', '日太阳总辐射(MJ/m2)',
                             '日净全辐射(MJ/m2)']

    # alias name
    area2dir = dict(zip(areas, data_dirs))
    add2area = {
        '小河区': '小河',
        '施秉县': '施秉',
        '福泉市': '福泉',
        '六枝特区': '六枝',
        '玉屏县': '玉屏',
        '毕节': '毕节',
        '剑河县': '剑河',
        '罗暮': '罗甸',
        '册亨县': '册亨',
        '遵义市': '遵义红花岗',
        '湄潭县': '湄潭',
        '四组': '独山',
        '独山县': '独山',
        '遵义红花岗区': '遵义红花岗',
        '遵义市红花岗': '遵义红花岗',
        '罗甸县': '罗甸'
    }

